In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
file_path = 'C:/python-data-analysis-master/python-data-analysis-master/data/drinks.csv'
drinks = pd.read_csv(file_path)
drinks['continent'] = drinks['continent'].fillna('OT')

In [3]:
# each continent's wine_servings
drinks['wine_servings_cont_avg'] = drinks.groupby('continent')['wine_servings'].transform(np.mean)

drinks[['country', 'continent', 'wine_servings_cont_avg']].sample(5).head()

            country continent  wine_servings_cont_avg
190           Yemen        AS                9.068182
117         Namibia        AF               16.264151
35            Chile        SA               62.416667
45   Czech Republic        EU              142.222222
110      Micronesia        OC               35.625000

In [4]:
# each country's total servings
drinks['total_servings'] = drinks['beer_servings'] + drinks['wine_servings'] + drinks['spirit_servings']
drinks[['country', 'beer_servings', 'wine_servings', 'spirit_servings', 'total_servings']].sample(5).head()

,country,beer_servings,wine_servings,spirit_servings,total_servings
26,Burkina Faso,25,7,7,39
67,Greece,133,218,112,463
89,Kiribati,21,1,34,56
121,New Zealand,203,175,79,457
178,Tuvalu,6,9,41,56